remidavidkoster/Redako-BibiFirmware/STM32G431/Core/Src/main.cpp
uint8_t failed;





/// PID Stuff

typedef struct {
	float p;
	float i;
	float d;

	float error;
	float prev_error;
	float derivative;
	float integral;
	float output;

	float dt;
	float alpha;  // Low-pass filter factor for the derivative term

	float limit;

	float target;
	float lastTarget;
} PIDController;


PIDController pid = {
		.p = 2.99999989e-008f,
		.i = 0.0f,
		.d = 9.99999975e-005f,
		.alpha = 0.001f,  // Set this based on how much filtering you want
		.limit = 0.005f,
		.target = 0.0f
};

float speed;
float electricalAngle;
float motorAngleFull;
float diaboloAngleFull;
float diaboloDistance;
float error;




/// Madwick Stuff

Madgwick filter;

#define SAMPLE_FREQUENCY 1000

typedef struct {
    volatile float angleFull;
    float anglePrev;
    float angleDelta;
    int turns;
    float currentAngle;
} MadgwickStruct;

MadgwickStruct madgwick;





/// Float send debug stuff

#pragma pack(push, 1)
typedef struct {
	float a;
	float b;
	float c;
	float d;
	float e;
	float f;
} FloatStruct;
#pragma pack(pop)

FloatStruct myData;

float reverseFloatBytes(float input) {
	uint8_t *bytes = (uint8_t *)&input;
	uint8_t reversed[4];

	reversed[0] = bytes[3];
	reversed[1] = bytes[2];
	reversed[2] = bytes[1];
	reversed[3] = bytes[0];

	float output;
	memcpy(&output, reversed, sizeof(float));
	return output;
}

void sendFloats(FloatStruct *data) {
	FloatStruct reversedData;

	reversedData.a = reverseFloatBytes(data->a);
	reversedData.b = reverseFloatBytes(data->b);
	reversedData.c = reverseFloatBytes(data->c);
	reversedData.d = reverseFloatBytes(data->d);
	reversedData.e = reverseFloatBytes(data->e);
	reversedData.f = reverseFloatBytes(data->f);

	HAL_UART_Transmit(&huart2, (uint8_t *)&reversedData, sizeof(FloatStruct), 1000);
}





/// Charge stuff

void CHG_RunLogic(){

	// Charge stuff
	CHG.standby = !HAL_GPIO_ReadPin(STDBY_GPIO_Port, STDBY_Pin);
	CHG.charging = !HAL_GPIO_ReadPin(CHRG_GPIO_Port, CHRG_Pin);
	CHG.plugged = HAL_GPIO_ReadPin(VBUS_PRESENT_GPIO_Port, VBUS_PRESENT_Pin);
	CHG.enabled = BAT.voltage > 2.5f;

	// Charge enable logic
	HAL_GPIO_WritePin(CHARGE_ENABLE_GPIO_Port, CHARGE_ENABLE_Pin, (GPIO_PinState)(CHG.plugged && CHG.enabled));
}





/// Gyro calib / init stuff

float gyro_offsets[3] = {0.0, 0.0, 0.0}; // To store the gyro offsets

// Function to calculate the standard deviation of a given array
float calculate_standard_deviation(float *data, int num_samples) {
    float sum = 0.0;
    float mean, stddev = 0.0;

    // Calculate the mean
    for (int i = 0; i < num_samples; i++) {
        sum += data[i];
    }
    mean = sum / num_samples;

    // Calculate the standard deviation
    for (int i = 0; i < num_samples; i++) {
        stddev += pow(data[i] - mean, 2);
    }
    return sqrt(stddev / num_samples);
}


#define STABILITY_THRESHOLD 0.0025f  // Threshold for accelerometer standard deviation
#define NUM_SAMPLES 100          // Number of samples to collect for both accelerometer and gyro
#define GRAVITY 9.81f             // Gravity constant in m/s^2

float accel_x_stddev;
float accel_y_stddev;
float accel_z_stddev;


void waitForStableGetGyroOffsets(){
	while (1) {
	    // Arrays to store accelerometer and gyro samples
	    float accel_x_samples[NUM_SAMPLES] = {0};
	    float accel_y_samples[NUM_SAMPLES] = {0};
	    float accel_z_samples[NUM_SAMPLES] = {0};
	    float gyro_x_samples[NUM_SAMPLES] = {0};
	    float gyro_y_samples[NUM_SAMPLES] = {0};
	    float gyro_z_samples[NUM_SAMPLES] = {0};

	    // Collect NUM_SAMPLES samples of accelerometer and gyro data
	    for (int i = 0; i < NUM_SAMPLES; i++) {
	        imu_data.accel = icm42670_read_accel(&imu); // Replace with actual accel read function
	        imu_data.gyro = icm42670_read_gyro(&imu);   // Replace with actual gyro read function

	        // Store the accelerometer and gyro samples
	        accel_x_samples[i] = imu_data.accel.x;
	        accel_y_samples[i] = imu_data.accel.y;
	        accel_z_samples[i] = imu_data.accel.z;
	        gyro_x_samples[i] = imu_data.gyro.x;
	        gyro_y_samples[i] = imu_data.gyro.y;
	        gyro_z_samples[i] = imu_data.gyro.z;

	        // Optional: Add a small delay between samples if necessary
	        HAL_Delay(10);
	    }

	    // Calculate the standard deviation for each axis of the accelerometer
	    accel_x_stddev = calculate_standard_deviation(accel_x_samples, NUM_SAMPLES);
	    accel_y_stddev = calculate_standard_deviation(accel_y_samples, NUM_SAMPLES);
	    accel_z_stddev = calculate_standard_deviation(accel_z_samples, NUM_SAMPLES);

	    // If the standard deviation of all axes is below the threshold, the accelerometer is stable
	    if (accel_x_stddev < STABILITY_THRESHOLD && accel_y_stddev < STABILITY_THRESHOLD && accel_z_stddev < STABILITY_THRESHOLD) {
	        //printf("Accelerometer is stable. Proceeding to gyro offset calculation...\n");

	        // Calculate the average of the gyro readings
	        float sum_gyro[3] = {0.0f, 0.0f, 0.0f};
	        for (int i = 0; i < NUM_SAMPLES; i++) {
	            sum_gyro[0] += gyro_x_samples[i];
	            sum_gyro[1] += gyro_y_samples[i];
	            sum_gyro[2] += gyro_z_samples[i];
	        }

	        gyro_offsets[0] = sum_gyro[0] / NUM_SAMPLES;
	        gyro_offsets[1] = sum_gyro[1] / NUM_SAMPLES;
	        gyro_offsets[2] = sum_gyro[2] / NUM_SAMPLES;

	        //printf("Gyro Offsets: X: %f, Y: %f, Z: %f\n", gyro_offsets[0], gyro_offsets[1], gyro_offsets[2]);
	        break;  // Exit the loop since we have successfully calculated the gyro offsets
	    } else {
	        //printf("Accelerometer is not stable. Retrying...\n");
	    }

	    // Optional: Add a small delay before trying again if needed
	    // usleep(10000); // Sleep for 10ms (if required)
	}
}











/// Main 10kHz pid loop

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
	if (htim->Instance == TIM6) {

		pid.error = madgwick.angleFull - pid.target;

		if (pid.target != pid.lastTarget){
			pid.prev_error = pid.error;
			pid.lastTarget = pid.target;
		}


