remidavidkoster/Redako-BibiFirmware/STM32G431/Core/Src/main.cpp
		// Derivative with low-pass filter
		pid.derivative = pid.alpha * (pid.error - pid.prev_error) * pid.d + (1 - pid.alpha) * pid.derivative;

		//pid.integral += pid.error * pid.i;

		//pid.integral = LIMIT(-pid.limit, pid.integral, pid.limit);

		// PID output
		pid.output = pid.p * pid.error + pid.derivative;// + pid.integral;

		pid.output = LIMIT(-pid.limit, pid.output, pid.limit);

		pid.prev_error = pid.error;

		//phaseVoltage = pid.output;

		speed += pid.output;

		speed = LIMIT(-pid.limit, speed, pid.limit);

		electricalAngle += speed;

		motorAngleFull = electricalAngle / POLE_PAIRS * RAD2DEG;

		setPhaseVoltage(phaseVoltage, electricalAngle);
	}
}




// Get position at time t during cosine motion profile
// Inputs:
//   t        - time since start [s]
//   duration - total movement time [s]
//   distance - total distance to travel [m]
// Output:
//   returns position traveled [m] at time t
float get_position(uint32_t t, uint32_t duration, float distance) {
    if (t <= 0) return 0.0f;
    if (t >= duration) return distance;

    float omega = TWO_PI / duration;
    float pos = (distance / duration) * (t - (sin(omega * t) / omega));
    return pos;
}


struct Movement {
	uint32_t start;
	uint32_t running;
	uint32_t startTimestamp;
	float distance;
	uint32_t duration;
	float startOffset;
	int direction;
};

struct Movement movement = {
    .start = 0,
    .running = 0,
    .startTimestamp = 0,
    .duration = 3000000,
    .startOffset = 0.0f,
	.direction = 1
};


/// Timing stuff

unsigned long microsPerReading, microsPrevious, microsUsed;









/// Quintic Movement Stuff

typedef struct {
    float rampRatio; // Determines max acceleration used
    float maxSpeed;
    float totalDistance;

    float rampTime;
    float cruiseTime;
    float totalTime;
    float rampDistance;
    float cruiseDistance;
} PositionProfile;

PositionProfile p = {
    .rampRatio = 0.1f,
    .maxSpeed = 0.1f,
    .totalDistance = 0.2f,
    .rampTime = 0.0f,
    .cruiseTime = 0.0f,
    .totalTime = 0.0f,
    .rampDistance = 0.0f,
    .cruiseDistance = 0.0f
};



void distanceSpeedRampRatioToProfileTimes(PositionProfile &p){
    // Calculate ramp up / ramp down time
    p.rampTime = p.maxSpeed / p.rampRatio;

    // Calculate total distance spent ramping up and down
    p.rampDistance = p.rampTime * p.maxSpeed;

    // Check if we can accelerate fast enough to reach max Speed
    if (p.rampDistance <= p.totalDistance){

        // We can! Calculate distance to spend cruising
        p.cruiseDistance = p.totalDistance - p.rampDistance;

        // Calculate time spent cruising
        p.cruiseTime = p.cruiseDistance / p.maxSpeed;
    }

    // If we can't reach max speed
    else {
        // We're fucked. Gotta recalculate the trajectory

        // The ramp ratio determines acceleration. That is fixed. Max speed becomes irrelevant if we can't reach that.
        // With a ramp ratio of 1 we can reach 1 speed in 1 time, and we'd move 0.5 distance. In total we'd move 1 distance in 2 time.
        // So for a ramp ratio of 1, the ramp time is 1 if we need to reach 1 distance.
        // For 4 distance, with a ramp ratio of 1, we'd reach 2 speed in 2 time. Moving 2 distance (0.5 * 2 * 2). Ramp time of 2.
        // With a ramp ratio of 2, we'd reach 2 speed in 1 time. Moving 1 distance in each half. Total distance of 2. Ramp time of 1.

        p.rampTime = sqrtf(p.totalDistance / p.rampRatio);
        p.maxSpeed = sqrtf(p.totalDistance * p.rampRatio);

        p.cruiseDistance = 0;
        p.cruiseTime = 0;
    }

    p.totalTime = 2 * p.rampTime + p.cruiseTime;
}



// Quintic curve function [0-1] in [0-1] out
float quinticCurve(float x) {
    return 10 * pow(x, 3) - 15 * pow(x, 4) + 6 * pow(x, 5);
}

// Quintic integral function [0-1] in [0-0.5] out
float quinticIntegral(float x) {
    return pow(x, 6) - 3 * pow(x, 5) + 2.5 * pow(x, 4);
}

// Quantic Curve Based Speed Profile
float quinticSpeedProfile(float currentTime, float rampTime, float cruiseTime, float maxSpeed) {
    // Limit bottom
    if (currentTime < 0) return 0;

    // Acceleration
    if (currentTime < rampTime) {
        return maxSpeed * quinticCurve(currentTime / rampTime);
    }

    // Constant velocity
    else if (currentTime < rampTime + cruiseTime) {
        return maxSpeed;
    }

    // Deceleration
    else if (currentTime < 2 * rampTime + cruiseTime) {
        return maxSpeed * (1 - quinticCurve((currentTime - rampTime - cruiseTime) / rampTime));
    }

    // Limit top
    else {
        return 0;
    }
}

// Quantic Curve Based Speed Profile Position Integral
float quinticPositionProfile(float currentTime, float rampTime, float cruiseTime, float maxSpeed) {

    // Limit bottom
    if (currentTime < 0) return 0;

    // Acceleration
    if (currentTime < rampTime) {
        return quinticIntegral(currentTime / rampTime) * rampTime * maxSpeed;
    }

    // Constant velocity
    else if (currentTime < rampTime + cruiseTime) {
        return 0.5 * maxSpeed * rampTime + (currentTime - rampTime) * maxSpeed;
    }

    // Deceleration
    else if (currentTime < 2 * rampTime + cruiseTime) {
        return maxSpeed * rampTime + cruiseTime * maxSpeed - (quinticIntegral((2 * rampTime + cruiseTime - currentTime) / rampTime) * rampTime * maxSpeed);
    }

    // Limit top
    else {
        return maxSpeed * rampTime + cruiseTime * maxSpeed;
    }
}





// Main loop
int main(void) {

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* Configure the system clock */
	SystemClock_Config();

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_I2C2_Init();
	MX_TIM1_Init();
	MX_TIM6_Init();
	MX_ADC1_Init();
	MX_SPI2_Init();
	MX_ADC2_Init();
	MX_TIM3_Init();
	MX_USART2_UART_Init();
	MX_TIM2_Init();




	// Set VREF to 2.5V
	HAL_SYSCFG_VREFBUF_VoltageScalingConfig(SYSCFG_VREFBUF_VOLTAGE_SCALE2);



	// Start microsecond timer, overflows after 71 minutes.
	HAL_TIM_Base_Start(&htim2);

	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);

